project/src/Catalogs/ПравилаКонвертацииПредопределенныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииПредопределенныхДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьГруппыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурацииКорреспондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Захвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриЗагрузкеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеКонфигурацииКорреспондент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТегВырезки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииПредопределенныхДанных/Forms/ФормаЭлементаXML/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьСпискиВыбораОбъектов();
	НастроитьСпискиВыбораЗначений(Истина, Истина);
	ПеречитатьИменаОбработчиков();
	ОбновитьИндикациюОбработчиков();
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	// Заполнение списка конвертаций данного правила.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций, ВедущаяКонфигурация);
	Иначе
		Если ЗначениеЗаполнено(Параметры.Конвертация) Тогда
			СписокКонвертаций.Добавить(Параметры.Конвертация);
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Конвертация, "ТипКонвертации, Конфигурация");

			Объект.ТипКонвертации = ДанныеКонвертации.ТипКонвертации;
			ВедущаяКонфигурация = ДанныеКонвертации.Конфигурация;
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Возможно новый элемент копируется - тогда список конвертаций необходимо заполнить.
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Параметры.ЗначениеКопирования, СписокКонвертаций, ВедущаяКонфигурация);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
			Объект.ГруппаПравил = Параметры.ГруппаПравил;
		КонецЕсли;
	КонецЕсли;
	// Списки конфигураций и конфигураций корреспондентов.
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	Конфигурации = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций);
	СписокКонфигураций.ЗагрузитьЗначения(Конфигурации);
	КонфигурацииКорреспондент = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций, "КонфигурацияКорреспондент");
	ВедущаяКонфигурацияКорреспондент = КонфигурацииКорреспондент[0];
	СписокКонфигурацийКорреспондент.ЗагрузитьЗначения(КонфигурацииКорреспондент);
	
	ЗаполнитьСпискиОбъектов();
	ЗаполнитьСпискиЗначений(Истина, Истина);
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("НомерСтрокиПКЗ") И ЗначениеЗаполнено(Параметры.НомерСтрокиПКЗ) Тогда
		Элементы.СопоставлениеЗначений.ТекущаяСтрока = Объект.СопоставлениеЗначений[Параметры.НомерСтрокиПКЗ-1];
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонвертацияДанныхXDTOВызовСервера.ПроверитьВозможностьЗаписиПравила(Отказ, ТекущийОбъект, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Порядок) Тогда
		// Новый порядок.
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	Максимум(Правила.Порядок) КАК Порядок
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правила.Ссылка И Состав.Владелец В (&Конвертации) 
		|ГДЕ
		|	ВЫРАЗИТЬ(Правила.ГруппаПравил КАК Строка(100)) = &Группа";
		
		Запрос.УстановитьПараметр("Группа", Лев(ТекущийОбъект.ГруппаПравил,100));
		Запрос.УстановитьПараметр("Конвертации", СписокКонвертаций.ВыгрузитьЗначения());

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий()
			И Выборка.Порядок <> NULL Тогда
			
			НовыйПорядок = Выборка.Порядок + 50;
			
		Иначе
			
			НовыйПорядок = 50;
			
		КонецЕсли;
		ТекущийОбъект.Порядок = НовыйПорядок;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Для нового правила создать запись в регистре
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Закрыта форма вопроса о составе конвертаций с изменением состава.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораНаСервере();
		ОбновитьОтображениеДанных();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Изменился состав конвертаций.
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	ОтказДобавления = Ложь;
	ДополнитьСоставКонвертации(РезультатЗакрытия, Объект.Ссылка, ОтказДобавления);
	Если ОтказДобавления Тогда
		ТекстПредупреждения = НСтр("ru = 'Данный элемент уже входит в состав выбранной конвертации'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	// Проверка на дубли
	Если КонвертацияДанныхXDTOВызовСервера.ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Тогда
		ОтказДобавления = Истина;
		Возврат;
	КонецЕсли;
	Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации);
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры


&НаКлиенте
Процедура ОбъектКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("РежимРаботы", "ОбъектКонфигурации");
	ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект[Элемент.Имя]);
	Если Элемент.Имя = "ОбъектКонфигурации" Тогда
		ПараметрыФормыВыбора.Вставить("МассивКонфигураций", СписокКонфигураций.ВыгрузитьЗначения());
	Иначе
		ПараметрыФормыВыбора.Вставить("МассивКонфигураций", СписокКонфигурацийКорреспондент.ВыгрузитьЗначения());
	КонецЕсли;
	ПараметрыФормыВыбора.Вставить("ДляПКПД", Истина);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбранОбъектКонфигурации", ЭтотОбъект, Элемент.Имя);

	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура ОбъектКонфигурацииПриИзменении(Элемент)
	Если Элемент.Имя = "ОбъектКонфигурации" Тогда
		ДляИсточника = Истина;
		ДляПолучателя = Ложь;
	Иначе
		ДляИсточника = Ложь;
		ДляПолучателя = Истина;
	КонецЕсли;
	ЗаполнитьСпискиЗначений(ДляИсточника, ДляПолучателя);
	НастроитьСпискиВыбораЗначений(ДляИсточника, ДляПолучателя);
КонецПроцедуры


&НаКлиенте
Процедура СопоставлениеЗначенийПередНачаломИзменения(Элемент, Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектКонфигурации) ИЛИ НЕ ЗначениеЗаполнено(Объект.ОбъектКонфигурацииКорреспондент) Тогда
		ТекстПредупреждения = НСтр("ru = 'Не указан объект источник или получатель'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	ПеречитатьИменаОбработчиков();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьЭлементВСоставКонвертации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать правило конвертации предопределенных данных'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранаКонвертация", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.ФормаВыбора",, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьАвтоматически(Команда)
	АвтоСопоставлениеЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификатор(Команда)
	Если НЕ (ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Или ЗначениеЗаполнено(Объект.ОбъектКонфигурацииКорреспондент)) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
		Код = СокрЛП(Объект.ОбъектКонфигурации);
	Иначе
		Код = СокрЛП(Объект.ОбъектКонфигурацииКорреспондент);
	КонецЕсли;
	Код = СтрЗаменить(Код, "Ссылка", "");
	Объект.Код = СтрЗаменить(Код, ".", "_");
	КодПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНеСопоставленные(Команда)
	НеСопоставленныеИсточник = Новый Массив;
	НеСопоставленныеПолучатель = Новый Массив;

	ПоказатьНеСопоставленныеСервер(НеСопоставленныеИсточник, НеСопоставленныеПолучатель); 
	Если НеСопоставленныеИсточник.Количество() = 0 И НеСопоставленныеПолучатель.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не сопоставленных значений не обнаружено.'"));
		Возврат;
	КонецЕсли;
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Область("R1C1").Текст = НСтр("ru='Значения конфигурации'");
	ТабДок.Область("R1C2").Текст = НСтр("ru='Значения конфигурации корреспондента'");
	Сч = 2;
	Для Каждого ЗнКонф Из НеСопоставленныеИсточник Цикл 
		ТабДок.Область("R"+сч + "C1").Текст = ЗнКонф;
		сч = сч + 1;
	КонецЦикла; 
	Для Каждого ЗнКонф Из НеСопоставленныеПолучатель Цикл 
		ТабДок.Область("R"+сч + "C2").Текст = ЗнКонф;
		сч = сч + 1;
	КонецЦикла;
    ТабДок.Показать(НСтр("ru='Не сопоставленные значения'"));
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСпискиОбъектов()
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	ОбластьПримененияСписка = Новый Структура("ДляПКО, ДляПКПД, ДляПРО", Ложь, Истина, Ложь);
	Если ЗначениеЗаполнено(ВедущаяКонфигурация) Тогда
		КонфигурацияФильтр = ВедущаяКонфигурация;
	Иначе
		КонфигурацияФильтр = СписокКонфигураций.ВыгрузитьЗначения();
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(СписокОбъектовКонфигурации, КонфигурацияФильтр,ОбластьПримененияСписка);
	
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(СписокОбъектовКонфигурацииКорреспондент, СписокКонфигурацийКорреспондент.ВыгрузитьЗначения(),ОбластьПримененияСписка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиЗначений(ДляИсточника, ДляПолучателя)
	Если ДляИсточника Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокЗначенийКонфигурации(СписокЗначенийКонфигурации, СписокКонфигураций.ВыгрузитьЗначения(), Объект.ОбъектКонфигурации);
	КонецЕсли;
	Если ДляПолучателя Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокЗначенийКонфигурации(СписокЗначенийКонфигурацииКорреспондент, СписокКонфигурацийКорреспондент.ВыгрузитьЗначения(), Объект.ОбъектКонфигурацииКорреспондент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораОбъектов()
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектКонфигурации, СписокОбъектовКонфигурации);
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектКонфигурацииКорреспондент, СписокОбъектовКонфигурацииКорреспондент);
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораЗначений(ДляИсточника, ДляПолучателя)
	Если ДляИсточника Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеЗначений.ПодчиненныеЭлементы.СопоставлениеЗначенийЗначениеКонфигурации,
			СписокЗначенийКонфигурации);
	КонецЕсли;
	Если ДляПолучателя Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(
			Элементы.СопоставлениеЗначений.ПодчиненныеЭлементы.СопоставлениеЗначенийЗначениеКонфигурацииКорреспондент,
			СписокЗначенийКонфигурацииКорреспондент);
	КонецЕсли;
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Объект[ДополнительныеПараметры] = РезультатЗакрытия.Ссылка;
	Иначе
		Объект[ДополнительныеПараметры] = РезультатЗакрытия;
	КонецЕсли;

	ОбъектКонфигурацииПриИзменении(Элементы[ДополнительныеПараметры]);
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура АвтоСопоставлениеЗначений()
	ТабСопоставленные = Объект.СопоставлениеЗначений.Выгрузить();
	Для Каждого ЗначениеКонф Из СписокЗначенийКонфигурации Цикл
		Если ТабСопоставленные.Найти(ЗначениеКонф.Значение, "ЗначениеКонфигурации") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СписокЗначенийКонфигурацииКорреспондент.НайтиПоЗначению(ЗначениеКонф.Значение) <> Неопределено Тогда
			НовСопоставление = Объект.СопоставлениеЗначений.Добавить();
			НовСопоставление.ЗначениеКонфигурации = ЗначениеКонф.Значение;
			НовСопоставление.ЗначениеКонфигурацииКорреспондент = ЗначениеКонф.Значение;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры 

&НаСервере
Процедура ПоказатьНеСопоставленныеСервер(НеСопоставленныеИсточник, НеСопоставленныеПолучатель)
	ТабСопоставленные = Объект.СопоставлениеЗначений.Выгрузить();
 	Для Каждого ЗначениеКонф Из СписокЗначенийКонфигурации Цикл
		Если ТабСопоставленные.Найти(ЗначениеКонф.Значение, "ЗначениеКонфигурации") = Неопределено Тогда 
			НеСопоставленныеИсточник.Добавить(ЗначениеКонф.Значение);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЗначениеКонф Из СписокЗначенийКонфигурацииКорреспондент Цикл
		Если ТабСопоставленные.Найти(ЗначениеКонф.Значение, "ЗначениеКонфигурацииКорреспондент") = Неопределено Тогда 
			НеСопоставленныеПолучатель.Добавить(ЗначениеКонф.Значение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИменаОбработчиков()
	НачалоИмени = "ПКО_"+СокрЛП(Объект.Код)+"_";
	ИмяОбработчикаПередВыгрузкой = НачалоИмени+"ПередВыгрузкойОбъекта";
	ИмяОбработчикаПриВыгрузке = НачалоИмени+"ПриВыгрузкеОбъекта";
	ИмяОбработчикаПослеВыгрузки = НачалоИмени+"ПослеВыгрузкиОбъекта";
	ИмяОбработчикаПослеВыгрузкиВФайл = НачалоИмени+"ПослеВыгрузкиОбъектаВФайлОбмена";
	ИмяОбработчикаПередЗагрузкой = НачалоИмени+"ПередЗагрузкойОбъекта";
	ИмяОбработчикаПриЗагрузке = НачалоИмени+"ПриЗагрузкеОбъекта";
	ИмяОбработчикаПослеЗагрузки = НачалоИмени+"ПослеЗагрузкиОбъекта";
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(Элементы.ОбработчикиXML, Объект, "");
КонецПроцедуры


#КонецОбласти
